## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_base_path_mapping.api_lambda_alt will be created
  + resource "aws_api_gateway_base_path_mapping" "api_lambda_alt" {
      + api_id      = "74i43aysii"
      + domain_name = "api.staging.notification.alpha.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2022-10-05T12:53:23Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:239043911459:74i43aysii/" -> (known after apply)
      ~ id            = "x1vi3o" -> (known after apply)
      ~ invoke_url    = "https://74i43aysii.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "c6c82525419ad1921c6aa791dc98e7eee4ec70b3" -> "fdd639a73d0e1caa9bce4e0cba8b52e747ab0d3b"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "x1vi3o" -> (known after apply)
        id                    = "ags-74i43aysii-v1"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.re_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

36 tests, 17 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
